In [28]:
import pandas as pd
df = pd.DataFrame({
    'name':['Маша', 'Вася', 'Гоша'],
    'age':[25, 8, 48],
    'job':['Программист', 'Школьник', 'Big Molokosos'],
    'salary':[100, 10, 200]
})

In [29]:
df

   name  age            job  salary
0  Маша   25    Программист     100
1  Вася    8       Школьник      10
2  Гоша   48  Big Molokosos     200

In [30]:
name = df['name']

In [31]:
name

0    Маша
1    Вася
2    Гоша
Name: name, dtype: object

In [32]:
df[df['salary'] >= 100] #пример сортировки

   name  age            job  salary
0  Маша   25    Программист     100
2  Гоша   48  Big Molokosos     200

In [33]:
df['salary'] *=3

In [34]:
df

   name  age            job  salary
0  Маша   25    Программист     300
1  Вася    8       Школьник      30
2  Гоша   48  Big Molokosos     600

In [36]:
df['salary'] / 2

0    150.0
1     15.0
2    300.0
Name: salary, dtype: float64

In [37]:
df

   name  age            job  salary
0  Маша   25    Программист     300
1  Вася    8       Школьник      30
2  Гоша   48  Big Molokosos     600

In [38]:
df['salary'] /= 2

In [39]:
df

   name  age            job  salary
0  Маша   25    Программист   150.0
1  Вася    8       Школьник    15.0
2  Гоша   48  Big Molokosos   300.0